const testList = {

    a: // อณุกรมเลขคณิต
    [
        { // 1
            id:"2 3 5 8 12 ...",
            ans: 4, // 17
            choice: generateChoice(14,16,15,17)
        },
        { // 2
            id:"119 120 122 123 126 127 ...",
            ans: 2, // 131
            choice: generateChoice(130,131,140,141)
        },
        { // 3
            id:"4 11 30 67 128 ...",
            ans: 4, // 219
            choice: generateChoice(147,186,195,219)
        },
        { // 4
            id:"3H8 5I9 7J11 9K14 ...",
            ans: 1, // 11L14
            choice: generateChoice("11L14","11L19","15M17","17O19")
        },
        { // 5
            id:"จากอนุกรม 2 ชุด ที่กำหนดให้ จงพิจารณาว่า ตัวเลขที่ผิดในอนุกรมชุดที่ 1 และ 2 คือข้อใด อนุกรมชุดที่ 1 คือ 2 3 5 8 11 17 อนุกรมชุดที่ 2 คือ 10 15 16 20 22 27",
            ans: 1, // 11,20
            choice: generateChoice("11,20","5,16","27,8","11,16")
        },
        { // 6
            id:"จงหา ค.ร.น. ของจำนวน 21 84 และ 105",
            ans: 3, // 420
            choice: generateChoice(3,275,420,565)
        },
        { // 7
            id:"5 % ของจำนวนหนึ่ง มีค่าเท่ากับ 200 อยากทราบว่าจำนวนนั้นมีค่าเท่าใด",
            ans: 1, // 400
            choice: generateChoice("4,000","3,500","4,600","12,500")
        },
        { // 8
            id:"นางสาวพอใจได้รับเงินเดือนๆ 14,775 เพราะถูกหักเข้ากองทุนประกันสังคม หาก อัตราเงินเดือนนางสาวพอใจคือ 15,000 บาท อยากทราบว่า นางสาวพอใจถูกหัก ค่าประกันสังคมกี่เปอร์เซ็นต์",
            ans: 1, // 1.5%
            choice: generateChoice("1.5%","1.7%","2.5%","3%")
        },
        { // 9
            id:"แรงงาน 15 คน สร้างบ้านหนึ่งหลังเสร็จในเวลา 20 วัน ถ้ามีแรงงานเพียง 10 คน จะสร้างบ้านให้เสร็จต้องเพิ่มเวลาในการสร้างบ้านอีกกี่เปอร์เซ็นต",
            ans: 4, // 50%
            choice: generateChoice("20%","35%","40%","50%")
        },
        { // 10
            id:"นงนุชมองนาฬิกาบนผนังห้อง พบว่าขณะนี้เป็นเวลา 08.00 น. อยากทราบว่าเข็ม สั้นจะทำมุมกับเข็มยาวกี่องศา",
            ans: 2, // 120
            choice: generateChoice(6,120,90,45)
        },
    ],

    b: // ตรีโกณมิติ
    [
        { // 1
            id:"จงหาค่าของ tan 380 ํ เมื่อ tan 20 ํ = 0.3640",
            ans: 4, // 0.3640
            choice: generateChoice(0.751,0.2381,0.546,0.3640)
        },
        { // 2
            id:"จงหาค่าของ sin(21π/4) x cos(3π/4-π) + cos(21π/4) x sin(3π/4-π)",
            ans: 4, // 0
            choice: generateChoice(0.46,1,0.3,0)
        },
        { // 3
            id:"จงหาค่าของ cot(π/4-2π) x sec(2π/3-π/2) x tan(arctan 1)",
            ans: 3, // √2
            choice: generateChoice("√3/2","1","√2","√3")
        },
        { // 4
            id:"จงหาค่าสูงสุดของฟังก์ชัน f(x) = 3sinx/2 + 4cosx/2 ในช่วง 0 < x <= π",
            ans: 1, // 5
            choice: generateChoice("5","3","8","10")
        },
        { // 5
            id:"จงหาค่าไซน์ของส่วนโค้งที่ยาวเท่ากับ 18.84 หน่วย (กำหนดให้ π=3.14)",
            ans: 4, // 0
            choice: generateChoice("2","-1","1","0")
        },
        { // 6
            id:"ถ้าแบ่งวงกลมหนึ่งหน่วยออกเป็น 6 ส่วนเท่าๆกัน แต่ละส่วนเรียกว่าเซกเตอร์ ถ้าลงสีลงบนเซกเตอร์หนึ่ง จงหาพื้นที่ของเซกเตอร์ดังกล่าว",
            ans: 2, // π/6
            choice: generateChoice("π/2","π/6","π/3","π/4")
        },
        { // 7
            id:"ภูเขาลูกหนึ่งมีด้านเอียงทำมุม 45 ํ และ 60 ํ กับแนะระดับตามลำดับ ถ้าด้านเอียงข้างหนึ่งทำมุม 60 ํ ยาวเท่ากับ 45 เมตร จงหาความยาวของด้านเอียงอีกด้านหนึ่ง",
            ans: 3, // 45√6/2
            choice: generateChoice("60√5","45√4/2","45√6/2","30√3/3")
        },
        { // 8
            id:"ถ้า θ ∈ (0, π/2] และ sinθ - cosθ = 1/5 จงหาค่าของ tanθ x secθ",
            ans: 2, // 20/9
            choice: generateChoice("20/6","20/9","10/5","21/3")
        },
        { // 9
            id:"ถ้า A และ B อยู่ในช่วง [π/2,π] จงหาว่า cos^2B + sin^2A จะมีค่ามากที่สุดเท่าไหร่",
            ans: 1, // 2
            choice: generateChoice("2","5","0","1")
        },
        { // 10
            id:"กำหนดให้ tan A = -12/5 เมื่อ A ∈ [0,π] และ secB = -5/4 เมื่อ π <= B <= 3π/2 แล้วจงหาค่าของ secA-sinB",
            ans: 4, // -2
            choice: generateChoice(-3,1,0,-2)
        },

    ],

    c: // ภาคตัดกรวย
    [
        { // 1
            id:"จงหาค่า k ที่ทำให้จุด A(-1,3) และ B(k,1) อยู่ห่างกัน 2 หน่วย",
            ans: 2, // -1
            choice: generateChoice(-2,-1,1,0)
        },
        { // 2
            id:"กำหนดให้จุด A เป็นจุดบนแกน y ซึ่งอยู่ห่างจากจุด (2,-3) และจุด (3,-4) เป็นระยะทางเท่ากัน จงหาว่าจุด A อยู่ห่างจากจุดกำเนิดกี่หน่วย",
            ans: 1, // 6 หน่วย
            choice: generateChoice("6 หน่วย","2 หน่วย","1 หน่วย","5 หน่วย")
        },
        { // 3
            id:"กำหนดรูปสามเหลี่ยมมีจุดยอด A(-6,-4), B(4,6) และ C(8,-2) ถ้า k เป็นความยาวของเส้นมัธยฐานที่ลากจากจุด B ไปยังด้าน AC แล้ว จงหา k^2",
            ans: 4, // 90
            choice: generateChoice("60","120","20","90")
        },
        { // 4
            id:"จงหา k ที่ทำให้เส้นตรงที่ผ่านจุด A(k,7) และ B(-3,-5) ขนานกับเส้นตรงที่ผ่านจุด C(3,5) และ D(2,-3)",
            ans: 1, // -1.5
            choice: generateChoice("-1.5","1.3","-2.1","-0.5")
        },
        { // 5
            id:"กำหนดให้ L เป็นเส้นตรงที่ผ่านจุด (-2,4) และตั้งฉากกับเส้นตรง 3x-2y-4=0 จงหาระยะตัดแกน X ของเส้นตรง L",
            ans: 3, // 4
            choice: generateChoice("3","5","4","1")
        },
        { // 6
            id:"เส้นตรง L มี a และ b เป็นระยะตัดแกน X และแกน Y ตามลำดับถ้า ab=4 และเส้นตรง L ผ่านจุด (1,1) และจุด (2,k) แล้ว จงหา k",
            ans: 2, // 0
            choice: generateChoice("2","0","-1","5")
        },
        { // 7
            id:"ถ้าระยะระหว่างเส้นตรง 5x-12y+30+k=0 กับจุด (-3,2) เท่ากับ 4 แล้ว จงหาผลบวกของค่า k ที่เป็นไปได้ทั้งหมด",
            ans: 3, // 18
            choice: generateChoice("-10","15","18","20")
        },
        { // 8
            id:"วงกลมที่มีจุดศูนย์กลาง (6,-3) และรัศมียาว 5 หน่วย จะตัดแกน x ที่จุดใดต่อไปนี้",
            ans: 4, // 20/9
            choice: generateChoice("(3,6) และ (5,4)","(2,1) และ (10,5)","(1,0) และ (8,3)","(2,0) และ (10,0)")
        },
        { // 9
            id:"กำหนดไฮเพอร์โบลามีสมการ 5y^2-4x^2 + 32x + 50y + 41 = 0 ข้อใดไม่ถูกต้องเกี่ยวกับไฮเพอร์โบลานี้",
            ans: 1, // 2
            choice: generateChoice("จุดศูนย์กลางอยู่ที่ (4,-5)","มีจุดยอดที่ (4,-3) และ (4,7)","มีโฟกัสอยู่ที่ (4,-1) และ (4,-9)","จุดปลายแกนสังยุคคือ (4+√5, -5) และ (4-√5,-5)")
        },
        { // 10
            id:"จงหาสมการวงกลมที่มีจุดศูนย์กลางอยู่ที่ (-1,2) และผ่านจุด (2,3)",
            ans: 4, // -2
            choice: generateChoice("(x-2)^2+(y+1)^2=10","(x+1)^2+(y-2)^2=100","(x+1)^2+(y-2)^2=10","(x-1)^2+(y-2)^2=10")
        },

    ]
};

function generateChoice(a,b,c,d){
    return [undefined,a,b,c,d]
}

function randomNumber(min, max) {
    return Math.floor(Math.random() * (max - min + 1) ) + min
}

function pickRandom(arr){
    if (arr.length === 0) {
        return undefined
      }
    
      const randomIndex = Math.floor(Math.random() * arr.length)
      const randomValue = arr.splice(randomIndex, 1)[0]
    
      return randomValue
}

function getTest(test, maxpage=10){
    let result = []
    let allPage = Array.from(Array(maxpage), (_, index) => index + 1);
    console.log(allPage)
    test = testList[test]
    if (test == undefined) {
        return console.log("Test not found")
    }
    for (let index = 0; index < test.length; index++) {
        let randomPage = pickRandom(allPage) 
        result[randomPage] = test[index]
    }
    console.log(result)
    return result
}

export {getTest}